# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'mackup'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts

# Apps
cask '1password'
cask 'dbngin'
cask 'docker'  
cask 'discord'
cask 'figma'
cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'kap'
# cask 'phpmon'
cask 'slack'
cask 'spotify'
cask 'tableplus'
# cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'tower'
# cask 'tunnelbear'
cask 'visual-studio-code'
# cask 'whatsapp'
cask 'zoom'

# Spatie Medialibrary
# brew 'jpegoptim'
# brew 'optipng'
# brew 'pngquant'
# brew 'svgo'
# brew 'gifsicle'

# Development
# brew 'php'
# brew 'php@8.0'
# brew 'php@7.4'
# brew 'composer'
# brew 'docker'
# brew 'colima'
brew 'ddev/ddev/ddev'
# brew 'imagemagick'
# brew 'mysql'
# brew 'nginx'
brew 'node'
brew 'nss'
# brew 'redis'
# brew 'yarn'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-fira-code'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Amphetamine', id: 937984704